import { mockUser } from './mockUser';
import { environment } from 'src/environments/environment';

const thumbnailUrl = environment.imageUrls.blog;
const user = mockUser;

export const mockBlogs = [
  {
    _id: '1',
    title: 'English blog title',
    thumbnail: thumbnailUrl + '1.png',
    content: '',
    author: {
      name: user.fullname,
      avatar: user.avatar,
    },
    createdAt: '2022-07-07 00:00:00',
    updatedAt: '2022-07-07 10:00:00',
  },
  {
    _id: '2',
    title: '日本のブログタイトル',
    thumbnail: thumbnailUrl + '2.png',
    content:
      '<p>適りづべき提込す積残ご不毎57現ユ実置一せぱびき禎院文命ょぐいト社犯テコ整隆ばがをど気聴遊基模ラぞめク。傷セシル多税えフゆス博確ウシヱユ国聴シカコヌ揃8退ノシ掲遊お覚潟ヘニ千神ミナヨオ午出転アセ不芸ラ本5比ホワ郎奇拝括樫フッ。兆ぎほみフ審車飯しふ価福めし逝医リユカタ断赤ハリム里79活他か重文上ホ高計クラぞで都解ス決権クうたお察具でろト。2雰暮ヱサ知隆川っほゆ玉普町あ政久功いひびは著行ノソエ同業ハ稿3能ぶ陰浅添瞬六く。客ねや聞隊スルユ臓称動ひそて州出ゅぶまッ入説井たはぐ成埋げ検幌カラヘ表理お暮植ノルネ図2票サト第両子生ぴゅれや。示ロ市読びたう必通るしいろ院去スソ芸目にろなぶ際名意コ立益リち抵97院ナレ禁食ヌウ記国ょろー医結ロナタ荒米八喜栄潟ふつぽじ。知ヘサレ幸画ユ族心ハ当併イコマ写43撮フハケワ渡馬やうべ国向あんリ天購ヒ約済ごそ芸地詳肘ごひがラ率音哲控魅体ぐりわぼ。2発ラ地法づへン星将89清べみー価例そでば親発るんーげ秒2大クラホケ子校ヱカ企電ケ軽債は優依阜よぶ害届角充救ちりずわ。数スイ聞農げ男佐聞女ごにふぞ感家キヘラツ覧除おんか出止生け太9者リネ兵弱ぱ見家示ぼなさん当奉おぜのイ。臨く持革づはわ風講ざばせな開朝ツリト結結志ハカ常機戸し下何ウ馬97逃きすほそ磐暮慈抹沙ざえ。92史ワ信石治真後ヌレ国倉シ講国ケムナ腕然よーうご城岡健ば異97悲ヒサラ帰修級件えもうば。間おざぎ水明環あすぶ魚賃メト広暮はくレ給界タテ対松ドぴすク済番クニ側時ぴゃを住匹はぼイさ託類そひ笑逮トチヒヲ作展リ。告クヨテ書修ヘヒ革筑53報え学途でぼ年選ツ中間ご磨抵キ稼3荷玉ばのび転決都む済千購リス左条伴飯駆げそ。県コノム下出へえづれ全止32端でたけ表真めびは権謙セモヨ込未フホスヘ幸辺ホヒ日否まむ帯利ホメモリ演榜ぱ時金ほろの内界のフ半売喰杜うーイ。記わ取90海約さスぞ賞際更イぎ退人ヘ学緑ヒケヨロ読左再ケニツ参麻ま学香リ暮倉ぐほの元月えてっり部借ヤカ永5問政部置ラぼ。例キオ能優びふ考講ヌスオミ民禁クむゃ諮明きほかを祉究シオラ染対くぐめふ再訴ミイリ地共困ロモ写稿せドく化掘承菱防二はくの。39京ぞねイか放徳案ワ果後クサロ既6番トびみに泊年くよへつ忠67未5給ゅゆ真旬ク著電ぜの世和呼っ話樹ナヤム書捜け碁手浜価航八かをゅぐ。備なお馬再調にお子政ゅでべル置職さょゃ面読カ切自ニシヌ村竜イス全加方つ供4近楽あえづ今旅アチキ度持作ヘ決図コレセキ小演をどな。生原ド議動かなゅ江掲ずーぴ告感きんド療北ワナア学女フイトク等明み帯会ぜッ文免びぜりも売4万軽も響納むリおん貢弘ば笛友日セソユ憶録んだ得悩織吏坦ぴ。案並さ記局タマキ四64高にで精無ワ株17律泊祥78音ヤミテ車茂行ヨニ都使ムフタヤ統購ほ展9外旅ヒ投国点端症で。嘉はぜゃ高室ミシ討男アメ索賞コケソ水福記探ムタト仕合ルロサ新産コ東明ろづうや顔口太まのを横君恵詳音こ。玲ヒ歩軽カア更君れ簿理球ロ無令主オホ誌板ンなちぜ統闘供そくなろ丘悪ごフラ謎真げるえレ増平ねわれ丹3県ぴをトる需当戦準ょさら。第が載庁タヱキナ本台駅曲なめづク供51崎着10般び約賛ほを儀25強詰ッ開雄ナイタレ制件ルマハ提亜才づぎ。専ケコノ子好ヤラワモ荒京ン量直づくッず楠間芸ソヒヨ職属書けひくど法試ハネヨヘ投筒ヌフカ切示れぶざ多征すわル容違マヲ就示残ハ降暮ね合降チト話化廃冒はろ。交6葉48提ね航65京イどゆ加破ミテエロ期股整モニテヤ変20声面スとつ櫛社ケソワヌ済際やけ芸判ヒク燃責冠すぴ。育テホセミ台教域フおやが学言みゆルだ告告リし覚軍でレ子過か端楽ミナム秋勢わ山以もじおる認賞過イ谷著妹は。情ぎきイだ前操フナキア情用日すひイ下文ゅ策汚知ア供非ヤ間気さきび変始繰ド解層ヨ渡能クオル固身ぎ解読フホ緊展ツカ渡井計週ひむ。響局カハ版光エ変5欠クルネ森85団抗化9招ノケナ気任ゃ実内シワノニ体彼ごこ事書ぽ行載高タセメ身方俣妃も。海らクイむ道票宅びッもみ被度憲ぞ告期ヘヒム動国がきゃび期疑オ第身イどぽ集給キマ訴札えなんあ族選ノア連54長ホノ明覧隅放コオノス樹傷ンク最経ゆは舞領抑就へま。秋りストぶ京併ばけべじ友対てフんな速小ず国職めへゅら転説なおまち実江3代フ無告予っ囲費ヌスアル石場送クニロ躍尊苦俵呉トりぼ。</p>',
    author: {
      name: user.fullname,
      avatar: user.avatar,
    },
    createdAt: '2022-07-07 00:00:00',
    updatedAt: '2022-07-07 10:00:00',
  },
  {
    _id: '3',
    title: 'No thumbnail blog title',
    thumbnail: '',
    content: '',
    author: {
      name: user.fullname,
      avatar: user.avatar,
    },
    createdAt: '2022-07-07 00:00:00',
    updatedAt: '2022-07-07 10:00:00',
  },
];
